<?php
//<!--3. Объявить массив, в котором в качестве ключей будут использоваться названия областей, -->
//<!--а в качестве значений – массивы с названиями городов из соответствующей области.-->
//<!--Вывести в цикле значения массива, чтобы результат был таким:-->
//<!--Московская область: Москва, Зеленоград, Клин-->
//<!--Ленинградская область: Санкт-Петербург, Всеволожск, Павловск, Кронштадт -->
//<!--Рязанская область … (названия городов можно найти на maps.yandex.ru)-->

$regions = [
    "Московская область" => [
        "Москва",
        "Зеленоград",
        "Клин"
    ],
    "Ленинградская область" => [
        "Санкт-Петербург",
        "Всеволожск",
        "Павловск",
        "Кронштадт"
    ],
    "Рязанская обсласть" => [
        "Рязань",
        "Новомичуринск",
        "Касимов",
        "Михайлов"
    ],
    "Омская область" => [
        "Омск",
        "Тара",
        "Исилькуль",
        "Калачинск",
        "Называевск",
        "Тюкалинск"
    ]
];

function printRegions(array $regions): string
{
    $result = "";
    foreach ($regions as $region => $cities){
        $result .= $region . ": ";
        foreach ($cities as $city){
            $result .= $city;
            if(end($cities) != $city){
                $result .=",";
            }
            $result .= " ";
        }
        $result .= PHP_EOL;
    }
    return $result;
}

echo printRegions($regions);